[Timeout] ConditionalExpression
services/AuthService.js:21:13
         userData.password = hash;
         let user = null;
         console.log(userData.role)
-        if (userData.role === Role.DOCTOR) {
+        if (false) {
             userData.qualifications = [];
             userData.specializations = [];

[Timeout] EqualityOperator
services/AuthService.js:21:13
         userData.password = hash;
         let user = null;
         console.log(userData.role)
-        if (userData.role === Role.DOCTOR) {
+        if (userData.role !== Role.DOCTOR) {
             userData.qualifications = [];
             userData.specializations = [];

[Killed] ConditionalExpression
services/AuthService.js:29:18
             userData.slots = [];
             user = new Doctor(userData);
         }
-        else if (userData.role === Role.PATIENT) {
+        else if (false) {
             user = new Patient(userData);
         }
killedBy: AuthService Integration Tests signup should create a new user and return token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
services/AuthService.js:29:18
             userData.slots = [];
             user = new Doctor(userData);
         }
-        else if (userData.role === Role.PATIENT) {
+        else if (userData.role !== Role.PATIENT) {
             user = new Patient(userData);
         }
killedBy: AuthService Integration Tests signup should create a new user and return token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Timeout] StringLiteral
services/AuthService.js:37:18
         const accessToken = jwt.sign({ _id: savedUser._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
         return {
             token: accessToken,
-            msg: "signed up successfully",
+            msg: "",
             status: 200,
             user: savedUser

[Killed] BlockStatement
services/AuthService.js:41:19
             status: 200,
             user: savedUser
         };
-    } catch (err) {
-        User.findOneAndDelete({ email: userData.email });
-        if ( err.code == 11000 ) {
-            return {
-                token: null,
-                msg: "User already exists",
-                status: 409
-            }
-        }
-        console.log(err)
-        return {
-            token: null,
-            msg: "Error during signup",
-            status: 500
-        };
-    }
+    } catch (err) {}
 };
   
killedBy: AuthService Integration Tests signup should reject duplicate email
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
services/AuthService.js:43:14
         };
     } catch (err) {
         User.findOneAndDelete({ email: userData.email });
-        if ( err.code == 11000 ) {
+        if ( false ) {
             return {
                 token: null,
killedBy: AuthService Integration Tests signup should reject duplicate email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 500

[Killed] BlockStatement
services/AuthService.js:43:34
         };
     } catch (err) {
         User.findOneAndDelete({ email: userData.email });
-        if ( err.code == 11000 ) {
-            return {
-                token: null,
-                msg: "User already exists",
-                status: 409
-            }
-        }
+        if ( err.code == 11000 ) {}
         console.log(err)
         return {
killedBy: AuthService Integration Tests signup should reject duplicate email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 500

[Killed] BlockStatement
services/AuthService.js:67:9
     let response = null;
     let accessToken = null;
     let user = null;
-    try {
-        user = await User.findOne({ email: userCreds.email })
-        if (!user) return {
-            token: null,
-            msg: "User not found",
-            status: 404
-        };
-        const match = await bcrypt.compare(userCreds.password, user.password);
-        if (match) {
-            accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
-        } else {
-            return {
-                    token: null,
-                    msg: "Wrong password",
-                    status: 401
-                };
-        }
-    } catch (err) {
+    try {} catch (err) {
         return {
             token: null,
killedBy: UserService Integration Tests getUser should return correct user
statusReason: TypeError: Cannot read properties of null (reading '_id')

[Timeout] ObjectLiteral
services/AuthService.js:68:35
     let accessToken = null;
     let user = null;
     try {
-        user = await User.findOne({ email: userCreds.email })
+        user = await User.findOne({})
         if (!user) return {
             token: null,

[Killed] BooleanLiteral
services/AuthService.js:69:13
     let user = null;
     try {
         user = await User.findOne({ email: userCreds.email })
-        if (!user) return {
+        if (user) return {
             token: null,
             msg: "User not found",
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: TypeError: Cannot read properties of undefined (reading '_id')

[Killed] ConditionalExpression
services/AuthService.js:69:13
     let user = null;
     try {
         user = await User.findOne({ email: userCreds.email })
-        if (!user) return {
+        if (true) return {
             token: null,
             msg: "User not found",
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: TypeError: Cannot read properties of undefined (reading '_id')

[Killed] StringLiteral
services/AuthService.js:71:18
         user = await User.findOne({ email: userCreds.email })
         if (!user) return {
             token: null,
-            msg: "User not found",
+            msg: "",
             status: 404
         };
killedBy: AuthService Integration Tests login should fail if user doesn't exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User not found"
Received: ""

[Killed] ConditionalExpression
services/AuthService.js:75:13
             status: 404
         };
         const match = await bcrypt.compare(userCreds.password, user.password);
-        if (match) {
+        if (false) {
             accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
         } else {
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: TypeError: Cannot read properties of undefined (reading '_id')

[Timeout] BlockStatement
services/AuthService.js:75:20
             status: 404
         };
         const match = await bcrypt.compare(userCreds.password, user.password);
-        if (match) {
-            accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
-        } else {
+        if (match) {} else {
             return {
                     token: null,

[Killed] ObjectLiteral
services/AuthService.js:76:36
         };
         const match = await bcrypt.compare(userCreds.password, user.password);
         if (match) {
-            accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
+            accessToken = jwt.sign({}, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
         } else {
             return {
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
services/AuthService.js:77:16
         const match = await bcrypt.compare(userCreds.password, user.password);
         if (match) {
             accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
-        } else {
-            return {
-                    token: null,
-                    msg: "Wrong password",
-                    status: 401
-                };
-        }
+        } else {}
     } catch (err) {
         return {
killedBy: AuthService Integration Tests login should reject wrong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ObjectLiteral
services/AuthService.js:78:20
         if (match) {
             accessToken = jwt.sign({ _id: user._id }, SECRET_ACCESS_TOKEN, { expiresIn: '24h' });
         } else {
-            return {
-                    token: null,
-                    msg: "Wrong password",
-                    status: 401
-                };
+            return {};
         }
     } catch (err) {
killedBy: AuthService Integration Tests login should reject wrong password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: undefined

[NoCoverage] BlockStatement
services/AuthService.js:84:19
                     status: 401
                 };
         }
-    } catch (err) {
-        return {
-            token: null,
-            msg: "Error during login",
-            status: 500
-        };
-    }
+    } catch (err) {}
     return {
         token: accessToken,

[NoCoverage] ObjectLiteral
services/AuthService.js:85:16
                 };
         }
     } catch (err) {
-        return {
-            token: null,
-            msg: "Error during login",
-            status: 500
-        };
+        return {};
     }
     return {

[NoCoverage] StringLiteral
services/AuthService.js:87:18
     } catch (err) {
         return {
             token: null,
-            msg: "Error during login",
+            msg: "",
             status: 500
         };

[Survived] StringLiteral
services/AuthService.js:93:14
     }
     return {
         token: accessToken,
-        msg: "Logged in successfully",
+        msg: "",
         status: 200,
         user: user
