[Killed] LogicalOperator
services/BookingService.js:11:13
 const createBooking = async (token, bookingData) => {
     try {
 
-        if (!bookingData || typeof bookingData !== 'object' || !bookingData.doctorID || !bookingData.slotID) {
+        if ((!bookingData || typeof bookingData !== 'object') && !bookingData.doctorID || !bookingData.slotID) {
             return { status: 400, msg: "Invalid booking data provided" };
         }
killedBy: BookingService createBooking() should return 400 if invalid booking data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:11:89
 const createBooking = async (token, bookingData) => {
     try {
 
-        if (!bookingData || typeof bookingData !== 'object' || !bookingData.doctorID || !bookingData.slotID) {
+        if (!bookingData || typeof bookingData !== 'object' || !bookingData.doctorID || bookingData.slotID) {
             return { status: 400, msg: "Invalid booking data provided" };
         }
killedBy: BookingService createBooking() should return 404 if slot not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Survived] StringLiteral
services/BookingService.js:12:40
     try {
 
         if (!bookingData || typeof bookingData !== 'object' || !bookingData.doctorID || !bookingData.slotID) {
-            return { status: 400, msg: "Invalid booking data provided" };
+            return { status: 400, msg: "" };
         }
         let bookedSlot = bookingData.slotID;

[Killed] BooleanLiteral
services/BookingService.js:17:13
         let bookedSlot = bookingData.slotID;
         bookedSlot = await Slot.findById(bookedSlot);
         
-        if (!bookedSlot) {
+        if (bookedSlot) {
             return { status: 404, msg: "Slot not found" };
         }
killedBy: BookingService createBooking() should return 404 if slot not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
services/BookingService.js:17:13
         let bookedSlot = bookingData.slotID;
         bookedSlot = await Slot.findById(bookedSlot);
         
-        if (!bookedSlot) {
+        if (true) {
             return { status: 404, msg: "Slot not found" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
services/BookingService.js:20:40
         if (!bookedSlot) {
             return { status: 404, msg: "Slot not found" };
         }
-        if (bookedSlot.capacity === 0) {
-            return { status: 400, msg: "Slot is full" };
-        }
+        if (bookedSlot.capacity === 0) {}
         bookedSlot.capacity = bookedSlot.capacity - 1;
         const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, { $set: { capacity: bookedSlot.capacity } });
killedBy: BookingService Integration Tests should fail if slot is full
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] EqualityOperator
services/BookingService.js:20:13
         if (!bookedSlot) {
             return { status: 404, msg: "Slot not found" };
         }
-        if (bookedSlot.capacity === 0) {
+        if (bookedSlot.capacity !== 0) {
             return { status: 400, msg: "Slot is full" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ArithmeticOperator
services/BookingService.js:23:31
         if (bookedSlot.capacity === 0) {
             return { status: 400, msg: "Slot is full" };
         }
-        bookedSlot.capacity = bookedSlot.capacity - 1;
+        bookedSlot.capacity = bookedSlot.capacity + 1;
         const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, { $set: { capacity: bookedSlot.capacity } });
         if (!updatedSlot) {
killedBy: BookingService Integration Tests should fail if slot is full
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ObjectLiteral
services/BookingService.js:24:75
             return { status: 400, msg: "Slot is full" };
         }
         bookedSlot.capacity = bookedSlot.capacity - 1;
-        const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, { $set: { capacity: bookedSlot.capacity } });
+        const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, {});
         if (!updatedSlot) {
             return { status: 500, msg: "Error while updating slot" };
killedBy: BookingService Integration Tests should fail if slot is full
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
services/BookingService.js:25:13
         }
         bookedSlot.capacity = bookedSlot.capacity - 1;
         const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, { $set: { capacity: bookedSlot.capacity } });
-        if (!updatedSlot) {
+        if (true) {
             return { status: 500, msg: "Error while updating slot" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:25:13
         }
         bookedSlot.capacity = bookedSlot.capacity - 1;
         const updatedSlot = await Slot.updateOne({ _id: bookedSlot._id }, { $set: { capacity: bookedSlot.capacity } });
-        if (!updatedSlot) {
+        if (updatedSlot) {
             return { status: 500, msg: "Error while updating slot" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
services/BookingService.js:31:13
         bookingData.slot = bookedSlot._id;
 
         const userRes = await getUser(token);
-        if (userRes.status !== 200) return userRes;
+        if (userRes.status === 200) return userRes;
         if (userRes.user.role !== Role.PATIENT) {
             return { status: 404, msg: "User is not a patient" };
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
services/BookingService.js:31:13
         bookingData.slot = bookedSlot._id;
 
         const userRes = await getUser(token);
-        if (userRes.status !== 200) return userRes;
+        if (true) return userRes;
         if (userRes.user.role !== Role.PATIENT) {
             return { status: 404, msg: "User is not a patient" };
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
services/BookingService.js:32:13
 
         const userRes = await getUser(token);
         if (userRes.status !== 200) return userRes;
-        if (userRes.user.role !== Role.PATIENT) {
+        if (userRes.user.role === Role.PATIENT) {
             return { status: 404, msg: "User is not a patient" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/BookingService.js:32:13
 
         const userRes = await getUser(token);
         if (userRes.status !== 200) return userRes;
-        if (userRes.user.role !== Role.PATIENT) {
+        if (true) {
             return { status: 404, msg: "User is not a patient" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ObjectLiteral
services/BookingService.js:33:20
         const userRes = await getUser(token);
         if (userRes.status !== 200) return userRes;
         if (userRes.user.role !== Role.PATIENT) {
-            return { status: 404, msg: "User is not a patient" };
+            return {};
         }
         const patientID = userRes.user._id;
killedBy: BookingService createBooking() should return 404 if user is not patient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: undefined

[Killed] ConditionalExpression
services/BookingService.js:44:13
             slot: bookingData.slotID,
             prescription: bookingData.prescription
         });
-        if (!booking) {
+        if (true) {
             return { status: 500, msg: "Error while creating booking" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:44:13
             slot: bookingData.slotID,
             prescription: bookingData.prescription
         });
-        if (!booking) {
+        if (booking) {
             return { status: 500, msg: "Error while creating booking" };
         }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] ObjectLiteral
services/BookingService.js:45:20
             prescription: bookingData.prescription
         });
         if (!booking) {
-            return { status: 500, msg: "Error while creating booking" };
+            return {};
         }
 

[Killed] ObjectLiteral
services/BookingService.js:48:16
             return { status: 500, msg: "Error while creating booking" };
         }
 
-        return { status: 200, msg: "Booking created successfully", booking: booking };
+        return {};
 
     }
killedBy: BookingService Integration Tests should create booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: undefined

[NoCoverage] BlockStatement
services/BookingService.js:51:17
         return { status: 200, msg: "Booking created successfully", booking: booking };
 
     }
-    catch (err) {
-        console.log(err);
-        return { status: 500, msg: err.name };
-    }
+    catch (err) {}
 }
 

[NoCoverage] ObjectLiteral
services/BookingService.js:53:16
     }
     catch (err) {
         console.log(err);
-        return { status: 500, msg: err.name };
+        return {};
     }
 }

[Killed] BlockStatement
services/BookingService.js:58:9
 }
 
 const getBookings = async (token) => {
-    try {
-        const userRes = await getUser(token);
-        if (userRes.status !== 200) return userRes;
-        const userID = userRes.user._id;
-        let bookings = null;
-
-        if (userRes.user.role === Role.PATIENT)
-            bookings = await Booking.find({ patient: userID })
-                .populate('patient')
-                .populate('doctor')
-                .populate('slot')
-                .populate('prescription')
-        else if (userRes.user.role === Role.DOCTOR)
-            bookings = await Booking.find({ doctor: userID })
-                .populate('patient')
-                .populate('doctor')
-                .populate('slot')
-                .populate('prescription')
-
-        if (!bookings)
-            return { status: 500, msg: "Error while fetching bookings" };
-
-        return { status: 200, msg: "Bookings fetched successfully", bookings: bookings };
-
-    }
+    try {}
     catch (err) {
         console.log(err);
killedBy: BookingService Integration Tests getBookings should return bookings for patient
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
services/BookingService.js:60:13
 const getBookings = async (token) => {
     try {
         const userRes = await getUser(token);
-        if (userRes.status !== 200) return userRes;
+        if (false) return userRes;
         const userID = userRes.user._id;
         let bookings = null;
killedBy: BookingService getBookings() should return error if user unauthorized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 500

[Killed] EqualityOperator
services/BookingService.js:64:13
         const userID = userRes.user._id;
         let bookings = null;
 
-        if (userRes.user.role === Role.PATIENT)
+        if (userRes.user.role !== Role.PATIENT)
             bookings = await Booking.find({ patient: userID })
                 .populate('patient')
killedBy: BookingService Integration Tests getBookings should return bookings for patient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/BookingService.js:64:13
         const userID = userRes.user._id;
         let bookings = null;
 
-        if (userRes.user.role === Role.PATIENT)
+        if (false)
             bookings = await Booking.find({ patient: userID })
                 .populate('patient')
killedBy: BookingService Integration Tests getBookings should return bookings for patient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
services/BookingService.js:66:27
 
         if (userRes.user.role === Role.PATIENT)
             bookings = await Booking.find({ patient: userID })
-                .populate('patient')
+                .populate("")
                 .populate('doctor')
                 .populate('slot')

[Survived] StringLiteral
services/BookingService.js:68:27
             bookings = await Booking.find({ patient: userID })
                 .populate('patient')
                 .populate('doctor')
-                .populate('slot')
+                .populate("")
                 .populate('prescription')
         else if (userRes.user.role === Role.DOCTOR)

[Survived] StringLiteral
services/BookingService.js:69:27
                 .populate('patient')
                 .populate('doctor')
                 .populate('slot')
-                .populate('prescription')
+                .populate("")
         else if (userRes.user.role === Role.DOCTOR)
             bookings = await Booking.find({ doctor: userID })

[Killed] ConditionalExpression
services/BookingService.js:70:18
                 .populate('doctor')
                 .populate('slot')
                 .populate('prescription')
-        else if (userRes.user.role === Role.DOCTOR)
+        else if (false)
             bookings = await Booking.find({ doctor: userID })
                 .populate('patient')
killedBy: BookingService getBookings() should fetch bookings for doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] EqualityOperator
services/BookingService.js:70:18
                 .populate('doctor')
                 .populate('slot')
                 .populate('prescription')
-        else if (userRes.user.role === Role.DOCTOR)
+        else if (userRes.user.role !== Role.DOCTOR)
             bookings = await Booking.find({ doctor: userID })
                 .populate('patient')
killedBy: BookingService getBookings() should fetch bookings for doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Survived] StringLiteral
services/BookingService.js:73:27
         else if (userRes.user.role === Role.DOCTOR)
             bookings = await Booking.find({ doctor: userID })
                 .populate('patient')
-                .populate('doctor')
+                .populate("")
                 .populate('slot')
                 .populate('prescription')

[Killed] ConditionalExpression
services/BookingService.js:77:13
                 .populate('slot')
                 .populate('prescription')
 
-        if (!bookings)
+        if (true)
             return { status: 500, msg: "Error while fetching bookings" };
 
killedBy: BookingService Integration Tests getBookings should return bookings for patient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:77:13
                 .populate('slot')
                 .populate('prescription')
 
-        if (!bookings)
+        if (bookings)
             return { status: 500, msg: "Error while fetching bookings" };
 
killedBy: BookingService Integration Tests getBookings should return bookings for patient
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:98:13
         if (userRes.status !== 200) return userRes;
 
         const booking = await Booking.findById(bookingID);
-        if (!booking)
+        if (booking)
             return { status: 404, msg: "Booking not found" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/BookingService.js:98:13
         if (userRes.status !== 200) return userRes;
 
         const booking = await Booking.findById(bookingID);
-        if (!booking)
+        if (true)
             return { status: 404, msg: "Booking not found" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] ObjectLiteral
services/BookingService.js:99:20
 
         const booking = await Booking.findById(bookingID);
         if (!booking)
-            return { status: 404, msg: "Booking not found" };
+            return {};
 
         if (userRes.user.role === Role.PATIENT)

[Killed] ConditionalExpression
services/BookingService.js:101:13
         if (!booking)
             return { status: 404, msg: "Booking not found" };
 
-        if (userRes.user.role === Role.PATIENT)
+        if (true)
             return { status: 403, msg: "Patient not authorized"};
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ObjectLiteral
services/BookingService.js:102:20
             return { status: 404, msg: "Booking not found" };
 
         if (userRes.user.role === Role.PATIENT)
-            return { status: 403, msg: "Patient not authorized"};
+            return {};
 
         if (userRes.user.role === Role.DOCTOR && booking.doctor.toString() !== userRes.user._id.toString())
killedBy: BookingService Integration Tests addPrescription should reject unauthorized patient attempt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: undefined

[Killed] ConditionalExpression
services/BookingService.js:104:50
         if (userRes.user.role === Role.PATIENT)
             return { status: 403, msg: "Patient not authorized"};
 
-        if (userRes.user.role === Role.DOCTOR && booking.doctor.toString() !== userRes.user._id.toString())
+        if (userRes.user.role === Role.DOCTOR && true)
             return { status: 403, msg: "Doctor not authorized" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] EqualityOperator
services/BookingService.js:104:50
         if (userRes.user.role === Role.PATIENT)
             return { status: 403, msg: "Patient not authorized"};
 
-        if (userRes.user.role === Role.DOCTOR && booking.doctor.toString() !== userRes.user._id.toString())
+        if (userRes.user.role === Role.DOCTOR && booking.doctor.toString() === userRes.user._id.toString())
             return { status: 403, msg: "Doctor not authorized" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] BooleanLiteral
services/BookingService.js:112:13
             medicines: medicines,
             comments: comments
         });
-        if (!prescription)
+        if (prescription)
             return { status: 500, msg: "Error while creating prescription" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/BookingService.js:112:13
             medicines: medicines,
             comments: comments
         });
-        if (!prescription)
+        if (true)
             return { status: 500, msg: "Error while creating prescription" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
services/BookingService.js:125:13
         // Update the booking
         const updatedBooking = await Booking.updateOne(
             { _id: bookingID },
-            { $set: { prescription: prescription._id } }
+            {}
         );
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
services/BookingService.js:125:21
         // Update the booking
         const updatedBooking = await Booking.updateOne(
             { _id: bookingID },
-            { $set: { prescription: prescription._id } }
+            { $set: {} }
         );
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
services/BookingService.js:128:13
             { $set: { prescription: prescription._id } }
         );
 
-        if (!updatedBooking)
+        if (true)
             return { status: 500, msg: "Error while updating booking" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/BookingService.js:128:13
             { $set: { prescription: prescription._id } }
         );
 
-        if (!updatedBooking)
+        if (updatedBooking)
             return { status: 500, msg: "Error while updating booking" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/BookingService.js:134:13
         // Fetch the updated booking with populated fields
         const populatedBooking = await Booking.findById(bookingID).populate('prescription');
 
-        if (!populatedBooking)
+        if (true)
             return { status: 404, msg: "Booking not found after update" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BooleanLiteral
services/BookingService.js:134:13
         // Fetch the updated booking with populated fields
         const populatedBooking = await Booking.findById(bookingID).populate('prescription');
 
-        if (!populatedBooking)
+        if (populatedBooking)
             return { status: 404, msg: "Booking not found after update" };
 
killedBy: BookingService Integration Tests addPrescription should allow doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[NoCoverage] StringLiteral
services/BookingService.js:135:40
         const populatedBooking = await Booking.findById(bookingID).populate('prescription');
 
         if (!populatedBooking)
-            return { status: 404, msg: "Booking not found after update" };
+            return { status: 404, msg: "" };
 
         return {

[NoCoverage] ObjectLiteral
services/BookingService.js:135:20
         const populatedBooking = await Booking.findById(bookingID).populate('prescription');
 
         if (!populatedBooking)
-            return { status: 404, msg: "Booking not found after update" };
+            return {};
 
         return {

[Killed] StringLiteral
services/BookingService.js:139:18
 
         return {
             status: 200,
-            msg: "Prescription added successfully",
+            msg: "",
             booking: populatedBooking
         };
killedBy: BookingService addPrescription() should successfully add prescription
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Prescription added successfully"
Received: ""
