[Killed] ConditionalExpression
services/DoctorService.js:14:13
         if (userRes.status !== 200) return userRes;
 
         const doctor = userRes.user;
-        if (doctor.role !== Role.DOCTOR) {
+        if (true) {
             return { status: 404, msg: "User is not a doctor" };
         }
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
services/DoctorService.js:14:13
         if (userRes.status !== 200) return userRes;
 
         const doctor = userRes.user;
-        if (doctor.role !== Role.DOCTOR) {
+        if (doctor.role === Role.DOCTOR) {
             return { status: 404, msg: "User is not a doctor" };
         }
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] BlockStatement
services/DoctorService.js:17:54
         if (doctor.role !== Role.DOCTOR) {
             return { status: 404, msg: "User is not a doctor" };
         }
-        if (!docData || typeof docData !== 'object') {
-            return { status: 400, msg: "Invalid doctor data provided" };
-        }
+        if (!docData || typeof docData !== 'object') {}
 
         const allowedUpdates = [
killedBy: DoctorService Integration Tests Should reject invalid update payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] LogicalOperator
services/DoctorService.js:17:13
         if (doctor.role !== Role.DOCTOR) {
             return { status: 404, msg: "User is not a doctor" };
         }
-        if (!docData || typeof docData !== 'object') {
+        if (!docData && typeof docData !== 'object') {
             return { status: 400, msg: "Invalid doctor data provided" };
         }
killedBy: DoctorService Integration Tests Should reject invalid update payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] StringLiteral
services/DoctorService.js:23:13
 
         const allowedUpdates = [
             'qualifications',
-            'specializations',
+            "",
             'experience',
             'description',
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Cardiology"
Received array: []

[Survived] MethodExpression
services/DoctorService.js:29:31
             'gender',
             'slots',
         ];
-        const sanitizedData = Object.keys(docData)
-            .filter((key) => allowedUpdates.includes(key))
+        const sanitizedData = Object.keys(docData)
             .reduce((acc, key) => {
                 acc[key] = docData[key];

[Killed] ArrowFunction
services/DoctorService.js:30:21
             'slots',
         ];
         const sanitizedData = Object.keys(docData)
-            .filter((key) => allowedUpdates.includes(key))
+            .filter(() => undefined)
             .reduce((acc, key) => {
                 acc[key] = docData[key];
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Cardiology"
Received array: []

[Killed] BlockStatement
services/DoctorService.js:31:35
         ];
         const sanitizedData = Object.keys(docData)
             .filter((key) => allowedUpdates.includes(key))
-            .reduce((acc, key) => {
-                acc[key] = docData[key];
-                return acc;
-            }, {});
+            .reduce((acc, key) => {}, {});
 
         if (sanitizedData.slots) {
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/DoctorService.js:36:13
                 return acc;
             }, {});
 
-        if (sanitizedData.slots) {
+        if (false) {
             if (!Array.isArray(sanitizedData.slots)) {
                 return { status: 400, msg: "Slots must be an array" };
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/DoctorService.js:36:13
                 return acc;
             }, {});
 
-        if (sanitizedData.slots) {
+        if (true) {
             if (!Array.isArray(sanitizedData.slots)) {
                 return { status: 400, msg: "Slots must be an array" };
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
services/DoctorService.js:37:54
             }, {});
 
         if (sanitizedData.slots) {
-            if (!Array.isArray(sanitizedData.slots)) {
-                return { status: 400, msg: "Slots must be an array" };
-            }
+            if (!Array.isArray(sanitizedData.slots)) {}
             sanitizedData.slots = await Promise.all(docData.slots.map(async (slot) => {
                 if (!slot || !slot.isAvailable || !slot.startingTime || !slot.endingTime || !slot.capacity) {
killedBy: DoctorService updateDoctor() should return 400 if slots are not an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Timeout] ConditionalExpression
services/DoctorService.js:37:17
             }, {});
 
         if (sanitizedData.slots) {
-            if (!Array.isArray(sanitizedData.slots)) {
+            if (true) {
                 return { status: 400, msg: "Slots must be an array" };
             }

[Killed] BlockStatement
services/DoctorService.js:40:87
             if (!Array.isArray(sanitizedData.slots)) {
                 return { status: 400, msg: "Slots must be an array" };
             }
-            sanitizedData.slots = await Promise.all(docData.slots.map(async (slot) => {
-                if (!slot || !slot.isAvailable || !slot.startingTime || !slot.endingTime || !slot.capacity) {
-                    throw new Error("Invalid slot data provided");
-                }
-                return await Slot.create({
-                    isAvailable: slot.isAvailable,
-                    timeInterval: slot.startingTime + ' - ' + slot.endingTime,
-                    capacity: slot.capacity,
-                });
-            }));
+            sanitizedData.slots = await Promise.all(docData.slots.map(async (slot) => {}));
         }
                     
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
services/DoctorService.js:41:21
                 return { status: 400, msg: "Slots must be an array" };
             }
             sanitizedData.slots = await Promise.all(docData.slots.map(async (slot) => {
-                if (!slot || !slot.isAvailable || !slot.startingTime || !slot.endingTime || !slot.capacity) {
+                if (true) {
                     throw new Error("Invalid slot data provided");
                 }
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/DoctorService.js:41:21
                 return { status: 400, msg: "Slots must be an array" };
             }
             sanitizedData.slots = await Promise.all(docData.slots.map(async (slot) => {
-                if (!slot || !slot.isAvailable || !slot.startingTime || !slot.endingTime || !slot.capacity) {
+                if (slot || !slot.isAvailable || !slot.startingTime || !slot.endingTime || !slot.capacity) {
                     throw new Error("Invalid slot data provided");
                 }
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] StringLiteral
services/DoctorService.js:46:55
                 }
                 return await Slot.create({
                     isAvailable: slot.isAvailable,
-                    timeInterval: slot.startingTime + ' - ' + slot.endingTime,
+                    timeInterval: slot.startingTime + "" + slot.endingTime,
                     capacity: slot.capacity,
                 });
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10:00 AM - 11:00 AM"
Received: "10:00 AM11:00 AM"

[Killed] ObjectLiteral
services/DoctorService.js:59:21
 
         const updatedDoctor = await Doctor.findOneAndUpdate(
             { _id: doctor._id },
-            { $set: {...sanitizedData, __t: 'user'} },
+            { $set: {} },
             { new: true }
         ).populate('slots');
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Cardiology"
Received array: []

[Killed] BooleanLiteral
services/DoctorService.js:60:20
         const updatedDoctor = await Doctor.findOneAndUpdate(
             { _id: doctor._id },
             { $set: {...sanitizedData, __t: 'user'} },
-            { new: true }
+            { new: false }
         ).populate('slots');
         
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Cardiology"
Received array: []

[Killed] StringLiteral
services/DoctorService.js:61:20
             { _id: doctor._id },
             { $set: {...sanitizedData, __t: 'user'} },
             { new: true }
-        ).populate('slots');
+        ).populate("");
         
         if (!updatedDoctor) {
killedBy: DoctorService Integration Tests Doctor should be able to create slots via update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10:00 AM - 11:00 AM"
Received: undefined

[Killed] ConditionalExpression
services/DoctorService.js:63:13
             { new: true }
         ).populate('slots');
         
-        if (!updatedDoctor) {
+        if (true) {
             return { status: 500, msg: "Failed to update doctor" };
         }
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BooleanLiteral
services/DoctorService.js:63:13
             { new: true }
         ).populate('slots');
         
-        if (!updatedDoctor) {
+        if (updatedDoctor) {
             return { status: 500, msg: "Failed to update doctor" };
         }
killedBy: DoctorService Integration Tests Doctor should update profile successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] StringLiteral
services/DoctorService.js:64:40
         ).populate('slots');
         
         if (!updatedDoctor) {
-            return { status: 500, msg: "Failed to update doctor" };
+            return { status: 500, msg: "" };
         }
 

[Killed] BlockStatement
services/DoctorService.js:72:17
             user: updatedDoctor,
             msg: "Updated successfully",
         };
-    } catch (e) {
-        console.error(e);
-        return {
-            status: 500,
-            msg: e.message,
-        };
-    }
+    } catch (e) {}
 };
 
killedBy: DoctorService updateDoctor() should return 500 if update fails
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Survived] ArrowFunction
services/DoctorService.js:87:17
         console.log(data)
         // update here
         const filterFields = {
-            id: (value) => ({ _id: value }),
+            id: () => undefined,
             name: (value) => ({ name: { $regex: value, $options: 'i' } }),
             gender: (value) => ({ gender: value }),

[Survived] ArrowFunction
services/DoctorService.js:88:19
         // update here
         const filterFields = {
             id: (value) => ({ _id: value }),
-            name: (value) => ({ name: { $regex: value, $options: 'i' } }),
+            name: () => undefined,
             gender: (value) => ({ gender: value }),
             experience: (value) => ({ experience: value }),

[Killed] ArrowFunction
services/DoctorService.js:89:21
         const filterFields = {
             id: (value) => ({ _id: value }),
             name: (value) => ({ name: { $regex: value, $options: 'i' } }),
-            gender: (value) => ({ gender: value }),
+            gender: () => undefined,
             experience: (value) => ({ experience: value }),
             specialization: (value) => ({ specializations: value }),
killedBy: DoctorService getAllDoctors() should apply filtering correctly (example: gender)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "gender": "female",
    "role": "DOCTOR",

[Survived] ArrowFunction
services/DoctorService.js:90:25
             id: (value) => ({ _id: value }),
             name: (value) => ({ name: { $regex: value, $options: 'i' } }),
             gender: (value) => ({ gender: value }),
-            experience: (value) => ({ experience: value }),
+            experience: () => undefined,
             specialization: (value) => ({ specializations: value }),
         };

[Killed] ArrowFunction
services/DoctorService.js:91:29
             name: (value) => ({ name: { $regex: value, $options: 'i' } }),
             gender: (value) => ({ gender: value }),
             experience: (value) => ({ experience: value }),
-            specialization: (value) => ({ specializations: value }),
+            specialization: () => undefined,
         };
         
killedBy: DoctorService Integration Tests getAllDoctors should return empty if no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
services/DoctorService.js:94:69
             specialization: (value) => ({ specializations: value }),
         };
         
-        const body = Object.keys(filterFields).reduce((acc, key) => {
-            if (data[key]) {
-                return { ...acc, ...filterFields[key](data[key]) };
-            }
-            return acc;
-        }, {});
+        const body = Object.keys(filterFields).reduce((acc, key) => {}, {});
         
         const doctors = await User.find({ role: Role.DOCTOR, ...body }).populate('slots');
killedBy: DoctorService Integration Tests getAllDoctors should return empty if no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
services/DoctorService.js:95:28
         };
         
         const body = Object.keys(filterFields).reduce((acc, key) => {
-            if (data[key]) {
-                return { ...acc, ...filterFields[key](data[key]) };
-            }
+            if (data[key]) {}
             return acc;
         }, {});
killedBy: DoctorService getAllDoctors() should apply filtering correctly (example: gender)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "gender": "female",
    "role": "DOCTOR",

[Killed] ConditionalExpression
services/DoctorService.js:95:17
         };
         
         const body = Object.keys(filterFields).reduce((acc, key) => {
-            if (data[key]) {
+            if (false) {
                 return { ...acc, ...filterFields[key](data[key]) };
             }
killedBy: DoctorService Integration Tests getAllDoctors should return empty if no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Survived] StringLiteral
services/DoctorService.js:105:18
         
         return {
             status: 200,
-            msg: "success",
+            msg: "",
             doctors: doctors
         }

[Killed] BlockStatement
services/DoctorService.js:109:17
             doctors: doctors
         }
     }
-    catch (err) {
-        console.error(err)
-        return {
-            status: 500,
-            msg: err.name,
-        }
-    }
+    catch (err) {}
 }
 export {
killedBy: DoctorService getAllDoctors() should return 500 when DB error occurs
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
services/DoctorService.js:111:16
     }
     catch (err) {
         console.error(err)
-        return {
-            status: 500,
-            msg: err.name,
-        }
+        return {}
     }
 }
killedBy: DoctorService getAllDoctors() should return 500 when DB error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: undefined
