[Killed] ConditionalExpression
services/HeartBeatService.js:12:9
 const getHeartBeat = async (token) => {
   try {
     const user = await getUser(token);
-    if (user.status !== 200) return user;
+    if (false) return user;
     if (user.user.role !== Role.DOCTOR) {
       return { status: 404, msg: "User is not a doctor" };
killedBy: HeartBeatService getHeartBeat() should return error when user unauthorized
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] EqualityOperator
services/HeartBeatService.js:12:9
 const getHeartBeat = async (token) => {
   try {
     const user = await getUser(token);
-    if (user.status !== 200) return user;
+    if (user.status === 200) return user;
     if (user.user.role !== Role.DOCTOR) {
       return { status: 404, msg: "User is not a doctor" };
killedBy: HeartBeatService Integration Tests should return no meetings if none exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No meetings scheduled"
Received: "found user"

[Killed] BlockStatement
services/HeartBeatService.js:13:41
   try {
     const user = await getUser(token);
     if (user.status !== 200) return user;
-    if (user.user.role !== Role.DOCTOR) {
-      return { status: 404, msg: "User is not a doctor" };
-    }
+    if (user.user.role !== Role.DOCTOR) {}
 
     // If doctor already has a pending meeting, use that so they can rejoin
killedBy: HeartBeatService getHeartBeat() should return 404 when user is not a doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ConditionalExpression
services/HeartBeatService.js:13:9
   try {
     const user = await getUser(token);
     if (user.status !== 200) return user;
-    if (user.user.role !== Role.DOCTOR) {
+    if (true) {
       return { status: 404, msg: "User is not a doctor" };
     }
killedBy: HeartBeatService Integration Tests should return no meetings if none exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] StringLiteral
services/HeartBeatService.js:14:34
     const user = await getUser(token);
     if (user.status !== 200) return user;
     if (user.user.role !== Role.DOCTOR) {
-      return { status: 404, msg: "User is not a doctor" };
+      return { status: 404, msg: "" };
     }
 

[Killed] ConditionalExpression
services/HeartBeatService.js:22:9
       doctorId: user.user._id,
       status: "pending",
     });
-    if (existing) {
+    if (true) {
       const meetToken = jwt.sign(
         { user_id: user.user._id },
killedBy: HeartBeatService getHeartBeat() should match next meeting in specialization list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
services/HeartBeatService.js:22:19
       doctorId: user.user._id,
       status: "pending",
     });
-    if (existing) {
-      const meetToken = jwt.sign(
-        { user_id: user.user._id },
-        process.env.SECRET_MEET_TOKEN,
-        { expiresIn: "1h" },
-      );
-
-      return {
-        status: 200,
-        msg: "You have a meeting scheduled",
-        callId: existing._id,
-        specialization: existing.specialization,
-        apiKey: process.env.API_KEY,
-        token: meetToken,
-      };
-    }
+    if (existing) {}
 
     // Look for a pending meet in any of the doctor's specializations
killedBy: HeartBeatService getHeartBeat() should return existing pending meet
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CALL123"
Received: undefined

[Survived] ObjectLiteral
services/HeartBeatService.js:24:9
     });
     if (existing) {
       const meetToken = jwt.sign(
-        { user_id: user.user._id },
+        {},
         process.env.SECRET_MEET_TOKEN,
         { expiresIn: "1h" },

[Survived] ObjectLiteral
services/HeartBeatService.js:26:9
       const meetToken = jwt.sign(
         { user_id: user.user._id },
         process.env.SECRET_MEET_TOKEN,
-        { expiresIn: "1h" },
+        {},
       );
 

[Survived] StringLiteral
services/HeartBeatService.js:31:14
 
       return {
         status: 200,
-        msg: "You have a meeting scheduled",
+        msg: "",
         callId: existing._id,
         specialization: existing.specialization,

[Killed] ConditionalExpression
services/HeartBeatService.js:40:19
     }
 
     // Look for a pending meet in any of the doctor's specializations
-    const specs = user.user.specializations || [];
+    const specs = false;
     for (let i = 0; i < specs.length; i++) {
       const spec = specs[i];
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] LogicalOperator
services/HeartBeatService.js:40:19
     }
 
     // Look for a pending meet in any of the doctor's specializations
-    const specs = user.user.specializations || [];
+    const specs = user.user.specializations && [];
     for (let i = 0; i < specs.length; i++) {
       const spec = specs[i];
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
services/HeartBeatService.js:41:21
 
     // Look for a pending meet in any of the doctor's specializations
     const specs = user.user.specializations || [];
-    for (let i = 0; i < specs.length; i++) {
+    for (let i = 0; false; i++) {
       const spec = specs[i];
 
killedBy: HeartBeatService getHeartBeat() should match next meeting in specialization list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M2"
Received: undefined

[Killed] EqualityOperator
services/HeartBeatService.js:41:21
 
     // Look for a pending meet in any of the doctor's specializations
     const specs = user.user.specializations || [];
-    for (let i = 0; i < specs.length; i++) {
+    for (let i = 0; i <= specs.length; i++) {
       const spec = specs[i];
 
killedBy: HeartBeatService getHeartBeat() should return no meeting if none available
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No meetings scheduled"
Received: "TypeError"

[Killed] MethodExpression
services/HeartBeatService.js:50:28
       });
 
       console.log("--------------- raw meets", meets, spec);
-      const filteredMeet = meets.filter(
-        (m) => m.rejectedBy.indexOf(user.user._id) === -1,
-      );
+      const filteredMeet = meets;
       console.log("--------------- filtered", filteredMeet);
 
killedBy: HeartBeatService getHeartBeat() should match next meeting in specialization list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M2"
Received: "M1"

[Killed] ConditionalExpression
services/HeartBeatService.js:51:16
 
       console.log("--------------- raw meets", meets, spec);
       const filteredMeet = meets.filter(
-        (m) => m.rejectedBy.indexOf(user.user._id) === -1,
+        (m) => false,
       );
       console.log("--------------- filtered", filteredMeet);
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
services/HeartBeatService.js:51:16
 
       console.log("--------------- raw meets", meets, spec);
       const filteredMeet = meets.filter(
-        (m) => m.rejectedBy.indexOf(user.user._id) === -1,
+        (m) => true,
       );
       console.log("--------------- filtered", filteredMeet);
killedBy: HeartBeatService getHeartBeat() should match next meeting in specialization list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "M2"
Received: "M1"

[Survived] StringLiteral
services/HeartBeatService.js:53:19
       const filteredMeet = meets.filter(
         (m) => m.rejectedBy.indexOf(user.user._id) === -1,
       );
-      console.log("--------------- filtered", filteredMeet);
+      console.log("", filteredMeet);
 
       if (filteredMeet.length > 0) {

[Killed] EqualityOperator
services/HeartBeatService.js:55:11
       );
       console.log("--------------- filtered", filteredMeet);
 
-      if (filteredMeet.length > 0) {
+      if (filteredMeet.length <= 0) {
         const m = filteredMeet[0];
 
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
services/HeartBeatService.js:55:36
       );
       console.log("--------------- filtered", filteredMeet);
 
-      if (filteredMeet.length > 0) {
-        const m = filteredMeet[0];
-
-        const meetToken = jwt.sign(
-          { user_id: user.user._id },
-          process.env.SECRET_MEET_TOKEN,
-          { expiresIn: "1h" },
-        );
-
-        return {
-          status: 200,
-          msg: "You have a meeting scheduled",
-          callId: m._id,
-          specialization: m.specialization, // important for frontend
-          apiKey: process.env.API_KEY,
-          token: meetToken,
-        };
-      }
+      if (filteredMeet.length > 0) {}
     }
 
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] StringLiteral
services/HeartBeatService.js:61:24
         const meetToken = jwt.sign(
           { user_id: user.user._id },
           process.env.SECRET_MEET_TOKEN,
-          { expiresIn: "1h" },
+          { expiresIn: "" },
         );
 
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ObjectLiteral
services/HeartBeatService.js:64:16
           { expiresIn: "1h" },
         );
 
-        return {
-          status: 200,
-          msg: "You have a meeting scheduled",
-          callId: m._id,
-          specialization: m.specialization, // important for frontend
-          apiKey: process.env.API_KEY,
-          token: meetToken,
-        };
+        return {};
       }
     }
killedBy: HeartBeatService Integration Tests doctor should detect pending meeting based on specialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: undefined

[NoCoverage] BlockStatement
services/HeartBeatService.js:79:17
       status: 200,
       msg: "No meetings scheduled",
     };
-  } catch (err) {
-    console.log(err);
-    return { status: 500, msg: err.name || "Internal server error" };
-  }
+  } catch (err) {}
 };
 

[NoCoverage] ConditionalExpression
services/HeartBeatService.js:81:32
     };
   } catch (err) {
     console.log(err);
-    return { status: 500, msg: err.name || "Internal server error" };
+    return { status: 500, msg: false };
   }
 };

[NoCoverage] LogicalOperator
services/HeartBeatService.js:81:32
     };
   } catch (err) {
     console.log(err);
-    return { status: 500, msg: err.name || "Internal server error" };
+    return { status: 500, msg: err.name && "Internal server error" };
   }
 };

[Killed] BlockStatement
services/HeartBeatService.js:86:7
 };
 
 const rejectHeartBeat = async (token, callId) => {
-  try {
-    const user = await getUser(token);
-    if (user.status !== 200) return user;
-    if (user.user.role !== Role.DOCTOR) {
-      return { status: 404, msg: "User is not a doctor" };
-    }
-
-    if (!callId) {
-      return { status: 400, msg: "callId is required" };
-    }
-
-    const meet = await Meet.findOne({ _id: callId });
-    if (!meet) return { status: 404, msg: "Meeting not found" };
-
-    if (meet.rejectedBy.indexOf(user.user._id) === -1) {
-      meet.rejectedBy.push(user.user._id);
-      await meet.save();
-    }
-
-    return {
-      status: 200,
-      msg: "Meeting rejected",
-    };
-  } catch (err) {
+  try {} catch (err) {
     console.log(err);
     return { status: 500, msg: err.name || "Internal server error" };
killedBy: HeartBeatService rejectHeartBeat() should return error if unauthorized
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
services/HeartBeatService.js:88:9
 const rejectHeartBeat = async (token, callId) => {
   try {
     const user = await getUser(token);
-    if (user.status !== 200) return user;
+    if (true) return user;
     if (user.user.role !== Role.DOCTOR) {
       return { status: 404, msg: "User is not a doctor" };
killedBy: HeartBeatService Integration Tests rejectHeartBeat should return error if invalid callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] ConditionalExpression
services/HeartBeatService.js:89:9
   try {
     const user = await getUser(token);
     if (user.status !== 200) return user;
-    if (user.user.role !== Role.DOCTOR) {
+    if (false) {
       return { status: 404, msg: "User is not a doctor" };
     }
killedBy: HeartBeatService Integration Tests rejectHeartBeat should fail for non-doctor
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User is not a doctor"
Received: "Meeting not found"

[Killed] ConditionalExpression
services/HeartBeatService.js:93:9
       return { status: 404, msg: "User is not a doctor" };
     }
 
-    if (!callId) {
+    if (false) {
       return { status: 400, msg: "callId is required" };
     }
killedBy: HeartBeatService Integration Tests rejectHeartBeat should return error if invalid callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BooleanLiteral
services/HeartBeatService.js:93:9
       return { status: 404, msg: "User is not a doctor" };
     }
 
-    if (!callId) {
+    if (callId) {
       return { status: 400, msg: "callId is required" };
     }
killedBy: HeartBeatService Integration Tests rejectHeartBeat should return error if invalid callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Timeout] BooleanLiteral
services/HeartBeatService.js:98:9
     }
 
     const meet = await Meet.findOne({ _id: callId });
-    if (!meet) return { status: 404, msg: "Meeting not found" };
+    if (meet) return { status: 404, msg: "Meeting not found" };
 
     if (meet.rejectedBy.indexOf(user.user._id) === -1) {

[Timeout] ConditionalExpression
services/HeartBeatService.js:98:9
     }
 
     const meet = await Meet.findOne({ _id: callId });
-    if (!meet) return { status: 404, msg: "Meeting not found" };
+    if (false) return { status: 404, msg: "Meeting not found" };
 
     if (meet.rejectedBy.indexOf(user.user._id) === -1) {

[Killed] ConditionalExpression
services/HeartBeatService.js:100:9
     const meet = await Meet.findOne({ _id: callId });
     if (!meet) return { status: 404, msg: "Meeting not found" };
 
-    if (meet.rejectedBy.indexOf(user.user._id) === -1) {
+    if (false) {
       meet.rejectedBy.push(user.user._id);
       await meet.save();
killedBy: HeartBeatService rejectHeartBeat() should successfully reject and update meeting
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] UnaryOperator
services/HeartBeatService.js:100:52
     const meet = await Meet.findOne({ _id: callId });
     if (!meet) return { status: 404, msg: "Meeting not found" };
 
-    if (meet.rejectedBy.indexOf(user.user._id) === -1) {
+    if (meet.rejectedBy.indexOf(user.user._id) === +1) {
       meet.rejectedBy.push(user.user._id);
       await meet.save();
killedBy: HeartBeatService rejectHeartBeat() should successfully reject and update meeting
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
services/HeartBeatService.js:107:12
 
     return {
       status: 200,
-      msg: "Meeting rejected",
+      msg: "",
     };
   } catch (err) {
