[Killed] BlockStatement
services/MeetService.js:13:38
 const SECRET_MEET_TOKEN = process.env.SECRET_MEET_TOKEN;
 
 // Helper: map backend Role enum to frontend string
-const mapRoleForFrontend = (role) => {
-  if (role === Role.PATIENT) return "patient";
-  if (role === Role.DOCTOR) return "doctor";
-  return "unknown";
-};
+const mapRoleForFrontend = (role) => {};
 
 const getMeetDetails = async (token, specialization, callId) => {
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "patient"
Received: undefined

[Killed] ConditionalExpression
services/MeetService.js:14:7
 
 // Helper: map backend Role enum to frontend string
 const mapRoleForFrontend = (role) => {
-  if (role === Role.PATIENT) return "patient";
+  if (true) return "patient";
   if (role === Role.DOCTOR) return "doctor";
   return "unknown";
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "doctor"
Received: "patient"

[Killed] ConditionalExpression
services/MeetService.js:14:7
 
 // Helper: map backend Role enum to frontend string
 const mapRoleForFrontend = (role) => {
-  if (role === Role.PATIENT) return "patient";
+  if (false) return "patient";
   if (role === Role.DOCTOR) return "doctor";
   return "unknown";
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "patient"
Received: "unknown"

[Killed] ConditionalExpression
services/MeetService.js:15:7
 // Helper: map backend Role enum to frontend string
 const mapRoleForFrontend = (role) => {
   if (role === Role.PATIENT) return "patient";
-  if (role === Role.DOCTOR) return "doctor";
+  if (false) return "doctor";
   return "unknown";
 };
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "doctor"
Received: "unknown"

[Killed] EqualityOperator
services/MeetService.js:15:7
 // Helper: map backend Role enum to frontend string
 const mapRoleForFrontend = (role) => {
   if (role === Role.PATIENT) return "patient";
-  if (role === Role.DOCTOR) return "doctor";
+  if (role !== Role.DOCTOR) return "doctor";
   return "unknown";
 };
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "doctor"
Received: "unknown"

[Killed] BlockStatement
services/MeetService.js:22:33
 const getMeetDetails = async (token, specialization, callId) => {
   try {
     const userRes = await getUser(token);
-    if (userRes.status !== 200) {
-      return userRes;
-    }
+    if (userRes.status !== 200) {}
 
     const user = await User.findById(userRes.user._id);
killedBy: MeetService getMeetDetails() should return error if user not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] ConditionalExpression
services/MeetService.js:22:9
 const getMeetDetails = async (token, specialization, callId) => {
   try {
     const userRes = await getUser(token);
-    if (userRes.status !== 200) {
+    if (false) {
       return userRes;
     }
killedBy: MeetService getMeetDetails() should return error if user not authenticated
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 500

[Killed] BooleanLiteral
services/MeetService.js:27:9
     }
 
     const user = await User.findById(userRes.user._id);
-    if (!user) {
+    if (user) {
       return { status: 404, msg: "User not found" };
     }
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/MeetService.js:27:9
     }
 
     const user = await User.findById(userRes.user._id);
-    if (!user) {
+    if (true) {
       return { status: 404, msg: "User not found" };
     }
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] EqualityOperator
services/MeetService.js:33:9
 
     let meeting = null;
 
-    if (user.role === Role.PATIENT) {
+    if (user.role !== Role.PATIENT) {
       // Patient always CREATES a new meeting
       if (!specialization) {
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] ConditionalExpression
services/MeetService.js:33:9
 
     let meeting = null;
 
-    if (user.role === Role.PATIENT) {
+    if (true) {
       // Patient always CREATES a new meeting
       if (!specialization) {
killedBy: MeetService getMeetDetails() should return 400 if doctor missing callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "callId is required for doctor"
Received: "Specialization is required for patient"

[Killed] BlockStatement
services/MeetService.js:35:28
 
     if (user.role === Role.PATIENT) {
       // Patient always CREATES a new meeting
-      if (!specialization) {
-        return { status: 400, msg: "Specialization is required for patient" };
-      }
+      if (!specialization) {}
 
       meeting = await new Meet({
killedBy: MeetService Integration Tests Patient must provide specialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BooleanLiteral
services/MeetService.js:35:11
 
     if (user.role === Role.PATIENT) {
       // Patient always CREATES a new meeting
-      if (!specialization) {
+      if (specialization) {
         return { status: 400, msg: "Specialization is required for patient" };
       }
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
services/MeetService.js:36:16
     if (user.role === Role.PATIENT) {
       // Patient always CREATES a new meeting
       if (!specialization) {
-        return { status: 400, msg: "Specialization is required for patient" };
+        return {};
       }
 
killedBy: MeetService Integration Tests Patient must provide specialization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] ObjectLiteral
services/MeetService.js:39:32
         return { status: 400, msg: "Specialization is required for patient" };
       }
 
-      meeting = await new Meet({
-        patientId: user._id,
-        status: "pending",
-        createdAt: new Date(),
-        specialization,
-      }).save();
+      meeting = await new Meet({}).save();
     } else if (user.role === Role.DOCTOR) {
       // Doctor JOINS an existing meeting by ID (can be first join or rejoin)
killedBy: MeetService Integration Tests Patient should create a new meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] ConditionalExpression
services/MeetService.js:45:16
         createdAt: new Date(),
         specialization,
       }).save();
-    } else if (user.role === Role.DOCTOR) {
+    } else if (false) {
       // Doctor JOINS an existing meeting by ID (can be first join or rejoin)
       if (!callId) {
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 403

[Killed] BlockStatement
services/MeetService.js:45:43
         createdAt: new Date(),
         specialization,
       }).save();
-    } else if (user.role === Role.DOCTOR) {
-      // Doctor JOINS an existing meeting by ID (can be first join or rejoin)
-      if (!callId) {
-        return { status: 400, msg: "callId is required for doctor" };
-      }
-
-      meeting = await Meet.findOneAndUpdate(
-        { _id: callId },
-        { $set: { doctorId: user._id } },
-        { new: true }
-      );
-
-      if (!meeting) {
-        return { status: 404, msg: "Meeting not found" };
-      }
-    } else {
+    } else if (user.role === Role.DOCTOR) {} else {
       return { status: 403, msg: "User role not allowed for meetings" };
     }
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6924a8569487b48a7e1053b3"
Received: "null"

[Killed] BooleanLiteral
services/MeetService.js:47:11
       }).save();
     } else if (user.role === Role.DOCTOR) {
       // Doctor JOINS an existing meeting by ID (can be first join or rejoin)
-      if (!callId) {
+      if (callId) {
         return { status: 400, msg: "callId is required for doctor" };
       }
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
services/MeetService.js:47:20
       }).save();
     } else if (user.role === Role.DOCTOR) {
       // Doctor JOINS an existing meeting by ID (can be first join or rejoin)
-      if (!callId) {
-        return { status: 400, msg: "callId is required for doctor" };
-      }
+      if (!callId) {}
 
       meeting = await Meet.findOneAndUpdate(
killedBy: MeetService Integration Tests Doctor must provide callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Survived] ObjectLiteral
services/MeetService.js:52:9
       }
 
       meeting = await Meet.findOneAndUpdate(
-        { _id: callId },
+        {},
         { $set: { doctorId: user._id } },
         { new: true }

[Survived] BooleanLiteral
services/MeetService.js:54:16
       meeting = await Meet.findOneAndUpdate(
         { _id: callId },
         { $set: { doctorId: user._id } },
-        { new: true }
+        { new: false }
       );
 

[Survived] ObjectLiteral
services/MeetService.js:54:9
       meeting = await Meet.findOneAndUpdate(
         { _id: callId },
         { $set: { doctorId: user._id } },
-        { new: true }
+        {}
       );
 

[Killed] BooleanLiteral
services/MeetService.js:57:11
         { new: true }
       );
 
-      if (!meeting) {
+      if (meeting) {
         return { status: 404, msg: "Meeting not found" };
       }
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/MeetService.js:57:11
         { new: true }
       );
 
-      if (!meeting) {
+      if (true) {
         return { status: 404, msg: "Meeting not found" };
       }
killedBy: MeetService Integration Tests Doctor should join existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
services/MeetService.js:58:36
       );
 
       if (!meeting) {
-        return { status: 404, msg: "Meeting not found" };
+        return { status: 404, msg: "" };
       }
     } else {
killedBy: MeetService Integration Tests Doctor should not join nonexistent meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Meeting not found"
Received: ""

[NoCoverage] BlockStatement
services/MeetService.js:60:12
       if (!meeting) {
         return { status: 404, msg: "Meeting not found" };
       }
-    } else {
-      return { status: 403, msg: "User role not allowed for meetings" };
-    }
+    } else {}
 
     const meetToken = jwt.sign(

[Survived] ArithmeticOperator
services/MeetService.js:67:25
     const meetToken = jwt.sign(
       {
         user_id: userRes.user._id,
-        iat: Math.floor(Date.now() / 1000) - 30,
+        iat: Math.floor(Date.now() * 1000) - 30,
       },
       SECRET_MEET_TOKEN,

[Survived] ArithmeticOperator
services/MeetService.js:67:14
     const meetToken = jwt.sign(
       {
         user_id: userRes.user._id,
-        iat: Math.floor(Date.now() / 1000) - 30,
+        iat: Math.floor(Date.now() / 1000) + 30,
       },
       SECRET_MEET_TOKEN,

[Survived] ObjectLiteral
services/MeetService.js:70:7
         iat: Math.floor(Date.now() / 1000) - 30,
       },
       SECRET_MEET_TOKEN,
-      { expiresIn: "1h" }
+      {}
     );
 

[NoCoverage] BlockStatement
services/MeetService.js:82:17
       apiKey: API_KEY,
       token: meetToken,
     };
-  } catch (err) {
-    console.error("getMeetDetails error", err);
-    return { status: 500, msg: "Internal server error" };
-  }
+  } catch (err) {}
 };
 

[NoCoverage] StringLiteral
services/MeetService.js:83:19
       token: meetToken,
     };
   } catch (err) {
-    console.error("getMeetDetails error", err);
+    console.error("", err);
     return { status: 500, msg: "Internal server error" };
   }

[NoCoverage] ObjectLiteral
services/MeetService.js:84:12
     };
   } catch (err) {
     console.error("getMeetDetails error", err);
-    return { status: 500, msg: "Internal server error" };
+    return {};
   }
 };

[Killed] BlockStatement
services/MeetService.js:89:7
 };
 
 const deleteMeetDetails = async (token, callId) => {
-  try {
-    const userRes = await getUser(token);
-    if (userRes.status !== 200) {
-      return userRes;
-    }
-
-    const user = userRes.user;
-
-    // Only patient or doctor can delete a meeting
-    if (user.role !== Role.PATIENT && user.role !== Role.DOCTOR) {
-      return { status: 403, msg: "User not allowed to delete meeting" };
-    }
-
-    if (!callId) {
-      return { status: 400, msg: "callId is required" };
-    }
-
-    const meeting = await Meet.findOneAndDelete({ _id: callId });
-    if (!meeting) {
-      return { status: 404, msg: "Meeting not found" };
-    }
-
-    return { status: 200, msg: "Meeting deleted successfully" };
-  } catch (err) {
+  try {} catch (err) {
     console.error("deleteMeetDetails error", err);
     return { status: 500, msg: "Internal server error" };
killedBy: MeetService Integration Tests deleteMeetDetails should delete existing meeting
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
services/MeetService.js:91:9
 const deleteMeetDetails = async (token, callId) => {
   try {
     const userRes = await getUser(token);
-    if (userRes.status !== 200) {
+    if (true) {
       return userRes;
     }
killedBy: MeetService Integration Tests deleteMeetDetails should delete existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Meeting deleted successfully"
Received: "found user"

[Killed] EqualityOperator
services/MeetService.js:91:9
 const deleteMeetDetails = async (token, callId) => {
   try {
     const userRes = await getUser(token);
-    if (userRes.status !== 200) {
+    if (userRes.status === 200) {
       return userRes;
     }
killedBy: MeetService Integration Tests deleteMeetDetails should delete existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Meeting deleted successfully"
Received: "found user"

[Killed] BlockStatement
services/MeetService.js:98:66
     const user = userRes.user;
 
     // Only patient or doctor can delete a meeting
-    if (user.role !== Role.PATIENT && user.role !== Role.DOCTOR) {
-      return { status: 403, msg: "User not allowed to delete meeting" };
-    }
+    if (user.role !== Role.PATIENT && user.role !== Role.DOCTOR) {}
 
     if (!callId) {
killedBy: MeetService deleteMeetDetails() should return 403 if user role not allowed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 404

[Killed] ConditionalExpression
services/MeetService.js:98:9
     const user = userRes.user;
 
     // Only patient or doctor can delete a meeting
-    if (user.role !== Role.PATIENT && user.role !== Role.DOCTOR) {
+    if (false) {
       return { status: 403, msg: "User not allowed to delete meeting" };
     }
killedBy: MeetService deleteMeetDetails() should return 403 if user role not allowed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 403
Received: 404

[Survived] StringLiteral
services/MeetService.js:99:34
 
     // Only patient or doctor can delete a meeting
     if (user.role !== Role.PATIENT && user.role !== Role.DOCTOR) {
-      return { status: 403, msg: "User not allowed to delete meeting" };
+      return { status: 403, msg: "" };
     }
 

[Killed] ConditionalExpression
services/MeetService.js:102:9
       return { status: 403, msg: "User not allowed to delete meeting" };
     }
 
-    if (!callId) {
+    if (true) {
       return { status: 400, msg: "callId is required" };
     }
killedBy: MeetService Integration Tests deleteMeetDetails should delete existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
services/MeetService.js:103:14
     }
 
     if (!callId) {
-      return { status: 400, msg: "callId is required" };
+      return {};
     }
 
killedBy: MeetService Integration Tests deleteMeetDetails should return error for missing callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] ConditionalExpression
services/MeetService.js:107:9
     }
 
     const meeting = await Meet.findOneAndDelete({ _id: callId });
-    if (!meeting) {
+    if (true) {
       return { status: 404, msg: "Meeting not found" };
     }
killedBy: MeetService Integration Tests deleteMeetDetails should delete existing meeting
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ConditionalExpression
services/MeetService.js:107:9
     }
 
     const meeting = await Meet.findOneAndDelete({ _id: callId });
-    if (!meeting) {
+    if (false) {
       return { status: 404, msg: "Meeting not found" };
     }
killedBy: MeetService Integration Tests deleteMeetDetails should return not found for invalid callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ObjectLiteral
services/MeetService.js:108:14
 
     const meeting = await Meet.findOneAndDelete({ _id: callId });
     if (!meeting) {
-      return { status: 404, msg: "Meeting not found" };
+      return {};
     }
 
killedBy: MeetService Integration Tests deleteMeetDetails should return not found for invalid callId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: undefined

[Timeout] StringLiteral
services/MeetService.js:111:32
       return { status: 404, msg: "Meeting not found" };
     }
 
-    return { status: 200, msg: "Meeting deleted successfully" };
+    return { status: 200, msg: "" };
   } catch (err) {
     console.error("deleteMeetDetails error", err);

[Timeout] ObjectLiteral
services/MeetService.js:111:12
       return { status: 404, msg: "Meeting not found" };
     }
 
-    return { status: 200, msg: "Meeting deleted successfully" };
+    return {};
   } catch (err) {
     console.error("deleteMeetDetails error", err);

[NoCoverage] BlockStatement
services/MeetService.js:112:17
     }
 
     return { status: 200, msg: "Meeting deleted successfully" };
-  } catch (err) {
-    console.error("deleteMeetDetails error", err);
-    return { status: 500, msg: "Internal server error" };
-  }
+  } catch (err) {}
 };
 

[NoCoverage] StringLiteral
services/MeetService.js:113:19
 
     return { status: 200, msg: "Meeting deleted successfully" };
   } catch (err) {
-    console.error("deleteMeetDetails error", err);
+    console.error("", err);
     return { status: 500, msg: "Internal server error" };
   }

[NoCoverage] StringLiteral
services/MeetService.js:114:32
     return { status: 200, msg: "Meeting deleted successfully" };
   } catch (err) {
     console.error("deleteMeetDetails error", err);
-    return { status: 500, msg: "Internal server error" };
+    return { status: 500, msg: "" };
   }
 };
