[Timeout] ConditionalExpression
services/UserService.js:11:9
 
 const getUser = async (token) => {
   try {
-    if (!token) throw new Error("No token provided");
+    if (true) throw new Error("No token provided");
 
     const decoded = jwtDecode(token);

[Timeout] BooleanLiteral
services/UserService.js:11:9
 
 const getUser = async (token) => {
   try {
-    if (!token) throw new Error("No token provided");
+    if (token) throw new Error("No token provided");
 
     const decoded = jwtDecode(token);

[Killed] BlockStatement
services/UserService.js:16:16
     const decoded = jwtDecode(token);
     const user = await User.findOne({ _id: decoded._id }).lean();
 
-    if (!user) {
-      return { user: null, msg: "User not found", status: 404 };
-    }
+    if (!user) {}
 
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
killedBy: UserService.js should return 404 when user not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Survived] StringLiteral
services/UserService.js:17:33
     const user = await User.findOne({ _id: decoded._id }).lean();
 
     if (!user) {
-      return { user: null, msg: "User not found", status: 404 };
+      return { user: null, msg: "", status: 404 };
     }
 

[Timeout] ArrayDeclaration
services/UserService.js:21:26
     }
 
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
-    let populatedSlots = [];
+    let populatedSlots = ["Stryker was here"];
     if (user.role === "DOCTOR" || user.role === "Doctor") {
       if (Array.isArray(user.slots) && user.slots.length > 0) {

[Survived] ConditionalExpression
services/UserService.js:22:9
 
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
     let populatedSlots = [];
-    if (user.role === "DOCTOR" || user.role === "Doctor") {
+    if (true) {
       if (Array.isArray(user.slots) && user.slots.length > 0) {
         populatedSlots = await Slot.find({ _id: { $in: user.slots } }).lean();

[Survived] BlockStatement
services/UserService.js:22:59
 
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
     let populatedSlots = [];
-    if (user.role === "DOCTOR" || user.role === "Doctor") {
-      if (Array.isArray(user.slots) && user.slots.length > 0) {
-        populatedSlots = await Slot.find({ _id: { $in: user.slots } }).lean();
-      }
-    }
+    if (user.role === "DOCTOR" || user.role === "Doctor") {}
 
     // Send back user with slots replaced by the populated slot objects (if any)

[Survived] ConditionalExpression
services/UserService.js:23:11
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
     let populatedSlots = [];
     if (user.role === "DOCTOR" || user.role === "Doctor") {
-      if (Array.isArray(user.slots) && user.slots.length > 0) {
+      if (true) {
         populatedSlots = await Slot.find({ _id: { $in: user.slots } }).lean();
       }

[Timeout] ConditionalExpression
services/UserService.js:23:40
     // If doctor, populate slots by fetching Slot docs whose ids are in user.slots
     let populatedSlots = [];
     if (user.role === "DOCTOR" || user.role === "Doctor") {
-      if (Array.isArray(user.slots) && user.slots.length > 0) {
+      if (Array.isArray(user.slots) && true) {
         populatedSlots = await Slot.find({ _id: { $in: user.slots } }).lean();
       }

[Timeout] ObjectLiteral
services/UserService.js:29:26
     }
 
     // Send back user with slots replaced by the populated slot objects (if any)
-    const userToReturn = {
-      ...user,
-      slots: populatedSlots.length > 0 ? populatedSlots : user.slots || [],
-    };
+    const userToReturn = {};
 
     return {

[Timeout] EqualityOperator
services/UserService.js:31:14
     // Send back user with slots replaced by the populated slot objects (if any)
     const userToReturn = {
       ...user,
-      slots: populatedSlots.length > 0 ? populatedSlots : user.slots || [],
+      slots: populatedSlots.length <= 0 ? populatedSlots : user.slots || [],
     };
 

[Timeout] LogicalOperator
services/UserService.js:31:59
     // Send back user with slots replaced by the populated slot objects (if any)
     const userToReturn = {
       ...user,
-      slots: populatedSlots.length > 0 ? populatedSlots : user.slots || [],
+      slots: populatedSlots.length > 0 ? populatedSlots : user.slots && [],
     };
 

[Timeout] ObjectLiteral
services/UserService.js:34:12
       slots: populatedSlots.length > 0 ? populatedSlots : user.slots || [],
     };
 
-    return {
-      msg: "found user",
-      status: 200,
-      user: userToReturn,
-    };
+    return {};
   } catch (err) {
     console.error("getUser error:", err);

[Killed] BlockStatement
services/UserService.js:39:17
       status: 200,
       user: userToReturn,
     };
-  } catch (err) {
-    console.error("getUser error:", err);
-    if (err.code === 11000) {
-      return { user: null, msg: err.name, status: 409 };
-    }
-    return { user: null, msg: err.message || err.name, status: 500 };
-  }
+  } catch (err) {}
 };
 
killedBy: UserService Integration Tests getUser returns error on invalid token
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
services/UserService.js:41:9
     };
   } catch (err) {
     console.error("getUser error:", err);
-    if (err.code === 11000) {
+    if (true) {
       return { user: null, msg: err.name, status: 409 };
     }
killedBy: UserService Integration Tests getUser returns error on invalid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 409

[Killed] EqualityOperator
services/UserService.js:41:9
     };
   } catch (err) {
     console.error("getUser error:", err);
-    if (err.code === 11000) {
+    if (err.code !== 11000) {
       return { user: null, msg: err.name, status: 409 };
     }
killedBy: UserService Integration Tests getUser returns error on invalid token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 409

[NoCoverage] ObjectLiteral
services/UserService.js:42:14
   } catch (err) {
     console.error("getUser error:", err);
     if (err.code === 11000) {
-      return { user: null, msg: err.name, status: 409 };
+      return {};
     }
     return { user: null, msg: err.message || err.name, status: 500 };

[Killed] ConditionalExpression
services/UserService.js:44:31
     if (err.code === 11000) {
       return { user: null, msg: err.name, status: 409 };
     }
-    return { user: null, msg: err.message || err.name, status: 500 };
+    return { user: null, msg: true, status: 500 };
   }
 };
killedBy: UserService Integration Tests getUser returns error on invalid token
statusReason: TypeError: res.msg.toLowerCase is not a function

[Killed] LogicalOperator
services/UserService.js:44:31
     if (err.code === 11000) {
       return { user: null, msg: err.name, status: 409 };
     }
-    return { user: null, msg: err.message || err.name, status: 500 };
+    return { user: null, msg: err.message && err.name, status: 500 };
   }
 };
killedBy: UserService.js should return 500 if no token
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "No token provided"
Received: "Error"

[Killed] BooleanLiteral
services/UserService.js:51:22
 
 const updateUser = async (userData) => {
   try {
-    if (!userData || !userData._id) {
+    if (!userData || userData._id) {
       return { user: null, msg: "Missing user _id", status: 400 };
     }
killedBy: UserService Integration Tests updateUser should update name and password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
services/UserService.js:51:9
 
 const updateUser = async (userData) => {
   try {
-    if (!userData || !userData._id) {
+    if (false) {
       return { user: null, msg: "Missing user _id", status: 400 };
     }
killedBy: UserService.js should return 400 if _id missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Timeout] StringLiteral
services/UserService.js:52:33
 const updateUser = async (userData) => {
   try {
     if (!userData || !userData._id) {
-      return { user: null, msg: "Missing user _id", status: 400 };
+      return { user: null, msg: "", status: 400 };
     }
 

[Killed] ConditionalExpression
services/UserService.js:56:9
     }
 
     // Hash password if provided
-    if (userData.password) {
+    if (false) {
       const pass = userData.password;
       const hash = await bcrypt.hash(pass, saltRounds);
killedBy: UserService.js should hash password when updating user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "pass123", 10

Number of calls: 0

[Killed] BlockStatement
services/UserService.js:56:28
     }
 
     // Hash password if provided
-    if (userData.password) {
-      const pass = userData.password;
-      const hash = await bcrypt.hash(pass, saltRounds);
-      userData.password = hash;
-    }
+    if (userData.password) {}
 
     // findOneAndUpdate needs a filter, update object and options
killedBy: UserService.js should hash password when updating user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "pass123", 10

Number of calls: 0

[Killed] BooleanLiteral
services/UserService.js:66:14
     const updated = await User.findOneAndUpdate(
       { _id: userData._id },
       { $set: userData },
-      { new: true, runValidators: true }
+      { new: false, runValidators: true }
     ).lean();
 
killedBy: UserService Integration Tests updateUser should update name and password
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated Name"
Received: "Patient"

[Survived] BooleanLiteral
services/UserService.js:66:35
     const updated = await User.findOneAndUpdate(
       { _id: userData._id },
       { $set: userData },
-      { new: true, runValidators: true }
+      { new: true, runValidators: false }
     ).lean();
 

[Killed] BlockStatement
services/UserService.js:69:19
       { new: true, runValidators: true }
     ).lean();
 
-    if (!updated) {
-      return { user: null, msg: "User not found", status: 404 };
-    }
+    if (!updated) {}
 
     return {
killedBy: UserService.js should return 404 if no updated doc
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 200

[Killed] ConditionalExpression
services/UserService.js:69:9
       { new: true, runValidators: true }
     ).lean();
 
-    if (!updated) {
+    if (true) {
       return { user: null, msg: "User not found", status: 404 };
     }
killedBy: UserService.js should hash password when updating user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] ObjectLiteral
services/UserService.js:70:14
     ).lean();
 
     if (!updated) {
-      return { user: null, msg: "User not found", status: 404 };
+      return {};
     }
 
killedBy: UserService.js should return 404 if no updated doc
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: undefined

[NoCoverage] BlockStatement
services/UserService.js:78:17
       msg: 'updated user',
       status: 200
     };
-  } catch (err) {
-    console.error("updateUser error:", err);
-    return { user: null, msg: err.message || err.name, status: 500 };
-  }
+  } catch (err) {}
 };
 

[NoCoverage] ConditionalExpression
services/UserService.js:80:31
     };
   } catch (err) {
     console.error("updateUser error:", err);
-    return { user: null, msg: err.message || err.name, status: 500 };
+    return { user: null, msg: true, status: 500 };
   }
 };

[NoCoverage] ConditionalExpression
services/UserService.js:80:31
     };
   } catch (err) {
     console.error("updateUser error:", err);
-    return { user: null, msg: err.message || err.name, status: 500 };
+    return { user: null, msg: false, status: 500 };
   }
 };
